# The Dataframes and Manipulation

In this particular excercise, I will be looking into detail dataframes in Pandas and create some dataframes.
Using this data I will perform all the experiments I would like on the data

In [1]:
# Imports
import pandas as pd
import numpy as np

In [2]:
#Exploring Dataframe structure
data_frame = pd.DataFrame()

In [3]:
data_frame

Empty DataFrame
Columns: []
Index: []

In [5]:
# Building a dataframe from series and dictionaries
Name = pd.Series(['Khadija', 'Hassan', 'Isaac', 'Michael', 'Sheila'])
City = pd.Series(['Nairobi', 'Kiambu', 'Nakuru', 'Malindi', 'Nairobi'])
dict = {'Name': Name, 'Town': City}

dataframe = pd.DataFrame(dict)

In [6]:
dataframe

      Name     Town
0  Khadija  Nairobi
1   Hassan   Kiambu
2    Isaac   Nakuru
3  Michael  Malindi
4   Sheila  Nairobi

In [7]:
# Creating a dataframe from in lists of dictionaries
Details = [{'Name': 'Carlos', 'Age':'24', 'Occupation': 'Sales Maneger', 'Salary': 40000},
           {'Name': 'Charity', 'Age':'34', 'Occupation': 'HR officer', 'Salary': 65000},
           {'Name': 'Michael', 'Age':'25', 'Occupation': 'Software Engineer', 'Salary': 96000}
          ] 
data_frame1 = pd.DataFrame(Details)
data_frame1

      Name Age         Occupation  Salary
0   Carlos  24      Sales Maneger   40000
1  Charity  34         HR officer   65000
2  Michael  25  Software Engineer   96000

In [9]:
# Creating a dataset to explore further
info = {'emp':[154, 567, 876, 307, 764, 123, 342], 
       'Name':['Ashley', 'Faith', 'Mark', 'Munene', 'George', 'Charity', 'Ken'],
       'Salary': [23000, 34000, 65000, 14000, 64000, 89000, 76000]}
dataf = pd.DataFrame(info)
dataf

   emp     Name  Salary
0  154   Ashley   23000
1  567    Faith   34000
2  876     Mark   65000
3  307   Munene   14000
4  764   George   64000
5  123  Charity   89000
6  342      Ken   76000

In [11]:
dataf['emp']

0    154
1    567
2    876
3    307
4    764
5    123
6    342
Name: emp, dtype: int64

In [14]:
data_frame1['Age']

0    24
1    34
2    25
Name: Age, dtype: object

In [18]:
dataf['Salary']

0    23000
1    34000
2    65000
3    14000
4    64000
5    89000
6    76000
Name: Salary, dtype: int64